info_book = [
    (1, "Мастер и Маргарита", 1, 10, 1940, "Библиотека №2" ),
    (2, "Капитанская дочка", 2, 9, 1836, "Москва" ),
    (3, "Золото бунта", 3, 8, 2005, "Москва" ),
    (4, "Внучка", 4, 7, 2023, "Москва" ),
    (5, "Убийство по алфативу", 5, 6, 1936, "Санкт-Петербург" ),
    (6, "Имя ветра", 6, 5, 2010, "Склад" ),
    (7, "Танцы с драконами", 7, 4, 2011, "Ростов-на-Дону" ),
    (8, "Семиевие", 8, 3, 2015, "Библиотека №1" ),
    (9, "Тьма после рассвета", 9, 2, 2022, "Санкт-Петербург" ),
    (10, "Веб-сборка полное руководство", 10, 1, 2022, "Вашингтон" ),
    (11, "Отцы и дети", 1, 10, 2013, "Москва"),
    (12, "Комната", 2, 9, 2010, "Музей им. Гоголя"),
    (13, "Пленница", 3, 8, 1999, "Библиотека №6"),
    (14, "Мальчик из гетто", 4, 7, 1997, "Библиотека №4"),
    (15, "Планета обезьян", 5, 6, 2004, "Билиотека №3"),
    (16, "Маленькая история", 6, 5, 2017, 'Библиотека №6'),
    (17, "Шило", 7, 4, 2011, "Склад"),
    (18, "Кухня", 8, 3, 2000, "Музей г. Керчь"),
    (19, "Столовая", 9, 2, 1990, "Библиотека №5"),
    (20, "Война", 10, 1, 2019, "Склад")
    ]





info_avtors = [
    (1, "Пушкин", "Александр"),
    (2, "Иванов", "Алексей"),
    (3, "Петров", "Евгений"),
    (4, "Кеннеди","Анна" ),
    (5, "Шлинк", "Бернхард"),
    (6, "Кристи","Агата"),
    (7, "Джордж", "Мартин"),
    (8, "Петров", "Александр"),
    (9,"Маринина", "Надежда"),
    (10,"Брайан", "Слеттен")
]

info_raz = [
    (1,),
    (2,),
    (3,),
    (4,),
    (5,),
    (6,),
    (7,),
    (8,),
    (9,),
    (10,)
]

info_izd = [
    (1, "Париж"),
    (2, "Москва"),
    (3, "Санкт-Петербург"),
    (4, "Ростов-на-Дону"),
    (5, "Аксай"),
    (6, "Владивосток"),
    (7, "Азов"),
    (8, "Казань"),
    (9, "Лондон"),
    (10, "Вашингтон")

]

info_a_b = [
(1, 1, 20),
(2, 2, 19),
(3, 3, 18),
(4, 4, 17),
(5, 5, 16),
(6, 6, 15),
(7, 7, 14),
(8, 8, 13),
(9, 9, 12),
(10, 10, 11),
(11, 1, 10),
(12, 2, 9),
(13, 3, 8),
(14, 4, 7),
(15, 5, 6),
(16, 6, 5),
(17, 7, 4),
(18, 8, 2),
(19, 9, 1),
(20, 10, 3)
]