info_b = [
    (1,  "Мастер и Маргарита", "Сатира", "YMCA-Press", '1940', "Париж" ),
    (2,  "Капитанская дочка", "Роман", "YMCA-Press", '1836', "Москва" ),
    (3,  "Золото бунта", "Роман", "Азбука-классика", '2005', "Москва" ),
    (4,  "Внучка", "Роман", "АСТ", '2023', "Москва" ),
    (5,  "Убийство по алфативу", "Детектив", "Эскмо", '1936', "Санкт-Петербург" ),
    (6,  "Имя ветра", "Роман", "Фанзон", '2010', "Склад" ),
    (7,  "Танцы с драконами", "Фантастика", "Фанзон", '2011', "Ростов-на-Дону" ),
    (8, "Семиевие", "Фантастика", "Фанзон", '2015', "Библиотека №1" ),
    (9, "Тьма после рассвета", "Детектив", "Эскмо", '2022', "Санкт-Петербург" ),
    (10, "Веб-сборка: полное руководство", "Справочник", "O'Reilly Media", '2022', "Вашингтон" )
    ]





info_a = [
    (1, "Пушкин", "Александр"),
    (2, "Иванов", "Алексей"),
    (3, "Петров", "Евгений"),
    (4, "Кеннеди","Анна" ),
    (5, "Шлинк", "Бернхард"),
    (6, "Кристи","Агата"),
    (7, "Джордж", "Мартин"),
    (8, "Нил","Стивенсон"),
    (9,"Алескандра","Маринина"),
    (10,"Слеттен","Брайан")
]

info_raz = [
    (1),
    (2),
    (3),
    (4),
    (5),
    (6),
    (7),
    (8),
    (9),
    (10)
]

info_izd = [
    (1, "Париж"),
    (2, "Москва"),
    (3, "Санкт-Петербург"),
    (4, "Ростов-на-Дону"),
    (5, ""),
    (6),
    (7),
    (8),
    (9),
    (10, "Вашингтон")

]